knieriem/tinygo-stm32-svd/svd/stm32h562.svd
			<register>
			  <name>ADC_CFGR</name>
			  <displayName>ADC_CFGR</displayName>
			  <description>ADC configuration register</description>
			  <addressOffset>0x0C</addressOffset>
			  <size>0x20</size>
			  <access>read-write</access>
			  <resetValue>0x80000000</resetValue>
			  <resetMask>0xFFFFFFFF</resetMask>
			  <fields>
				<field>
				  <name>DMAEN</name>
				  <description>Direct memory access enable
	</description>
				  <bitOffset>0</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>DMA disabled</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>DMA enabled</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>DMACFG</name>
				  <description>Direct memory access configuration
	</description>
				  <bitOffset>1</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>DMA One Shot mode selected</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>DMA Circular mode selected</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>RES</name>
				  <description>Data resolution
	</description>
				  <bitOffset>3</bitOffset>
				  <bitWidth>2</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>12-bit</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>10-bit</description>
					  <value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x2</name>
					  <description>8-bit</description>
					  <value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x3</name>
					  <description>6-bit</description>
					  <value>0x3</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
					<name>EXTSEL</name>
					<description>External trigger selection for regular group
These bits select the external event used to trigger the start of conversion of a regular group:
...
Note: The software is allowed to write these bits only when ADSTART = 0 (which ensures that no regular conversion is ongoing).</description>
					<bitOffset>5</bitOffset>
					<bitWidth>5</bitWidth>
					<access>read-write</access>
					<enumeratedValues>
					  <enumeratedValue>
						<name>B_0x0</name>
						<description>adc_ext_trg0</description>
						<value>0x0</value>
					  </enumeratedValue>
					  <enumeratedValue>
						<name>B_0x1</name>
						<description>adc_ext_trg1</description>
						<value>0x1</value>
					  </enumeratedValue>
					  <enumeratedValue>
						<name>B_0x2</name>
						<description>adc_ext_trg2</description>
						<value>0x2</value>
					  </enumeratedValue>
					  <enumeratedValue>
						<name>B_0x3</name>
						<description>adc_ext_trg3</description>
						<value>0x3</value>
					  </enumeratedValue>
					  <enumeratedValue>
						<name>B_0x4</name>
						<description>adc_ext_trg4</description>
						<value>0x4</value>
					  </enumeratedValue>
					  <enumeratedValue>
						<name>B_0x5</name>
						<description>adc_ext_trg5</description>
						<value>0x5</value>
					  </enumeratedValue>
					  <enumeratedValue>
						<name>B_0x6</name>
						<description>adc_ext_trg6</description>
						<value>0x6</value>
					  </enumeratedValue>
					  <enumeratedValue>
						<name>B_0x7</name>
						<description>adc_ext_trg7</description>
						<value>0x7</value>
					  </enumeratedValue>
					  <enumeratedValue>
						<name>B_0x8</name>
						<description>adc_ext_trg8</description>
						<value>0x8</value>
					  </enumeratedValue>
					  <enumeratedValue>
						<name>B_0x9</name>
						<description>adc_ext_trg9</description>
						<value>0x9</value>
					  </enumeratedValue>
					  <enumeratedValue>
						<name>B_0xA</name>
						<description>adc_ext_trg10</description>
						<value>0xA</value>
					  </enumeratedValue>
					  <enumeratedValue>
						<name>B_0xB</name>
						<description>adc_ext_trg11</description>
						<value>0xB</value>
					  </enumeratedValue>
					  <enumeratedValue>
						<name>B_0xC</name>
						<description>adc_ext_trg12</description>
						<value>0xC</value>
					  </enumeratedValue>
					  <enumeratedValue>
						<name>B_0xD</name>
						<description>adc_ext_trg13</description>
						<value>0xD</value>
					  </enumeratedValue>
					  <enumeratedValue>
						<name>B_0xE</name>
						<description>adc_ext_trg14</description>
						<value>0xE</value>
					  </enumeratedValue>
					  <enumeratedValue>
						<name>B_0xF</name>
						<description>adc_ext_trg15</description>
						<value>0xF</value>
					  </enumeratedValue>
					  <enumeratedValue>
						<name>B_0x10</name>
						<description>adc_ext_trg16</description>
						<value>0x10</value>
					  </enumeratedValue>
					  <enumeratedValue>
						<name>B_0x11</name>
						<description>adc_ext_trg17</description>
						<value>0x11</value>
					  </enumeratedValue>
					  <enumeratedValue>
						<name>B_0x12</name>
						<description>adc_ext_trg18</description>
						<value>0x12</value>
					  </enumeratedValue>
					  <enumeratedValue>
						<name>B_0x13</name>
						<description>adc_ext_trg19</description>
						<value>0x13</value>
					  </enumeratedValue>
					  <enumeratedValue>
						<name>B_0x14</name>
						<description>adc_ext_trg20</description>
						<value>0x14</value>
					  </enumeratedValue>
					  <enumeratedValue>
						<name>B_0x15</name>
						<description>adc_ext_trg21</description>
						<value>0x15</value>
					  </enumeratedValue>
					  <enumeratedValue>
						<name>B_0x16</name>
						<description>adc_ext_trg22</description>
						<value>0x16</value>
					  </enumeratedValue>
					  <enumeratedValue>
						<name>B_0x17</name>
						<description>adc_ext_trg23</description>
						<value>0x17</value>
					  </enumeratedValue>
					  <enumeratedValue>
						<name>B_0x18</name>
						<description>adc_ext_trg24</description>
						<value>0x18</value>
					  </enumeratedValue>
					  <enumeratedValue>
						<name>B_0x19</name>
						<description>adc_ext_trg25</description>
						<value>0x19</value>
					  </enumeratedValue>
					  <enumeratedValue>
						<name>B_0x1A</name>
						<description>adc_ext_trg26</description>
						<value>0x1A</value>
					  </enumeratedValue>
					  <enumeratedValue>
						<name>B_0x1B</name>
						<description>adc_ext_trg27</description>
						<value>0x1B</value>
					  </enumeratedValue>
					  <enumeratedValue>
						<name>B_0x1C</name>
						<description>adc_ext_trg28</description>
						<value>0x1C</value>
					  </enumeratedValue>
					  <enumeratedValue>
						<name>B_0x1D</name>
						<description>adc_ext_trg29</description>
						<value>0x1D</value>
					  </enumeratedValue>
					  <enumeratedValue>
						<name>B_0x1E</name>
						<description>adc_ext_trg30</description>
						<value>0x1E</value>
					  </enumeratedValue>
					  <enumeratedValue>
						<name>B_0x1F</name>
						<description>adc_ext_trg31</description>
						<value>0x1F</value>
					  </enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>EXTEN</name>
				  <description>External trigger enable and polarity selection for regular channels
	</description>
				  <bitOffset>10</bitOffset>
				  <bitWidth>2</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>Hardware trigger detection disabled (conversions can be launched by software)</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>Hardware trigger detection on the rising edge</description>
					  <value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x2</name>
					  <description>Hardware trigger detection on the falling edge</description>
					  <value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x3</name>
					  <description>Hardware trigger detection on both the rising and falling edges</description>
					  <value>0x3</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>OVRMOD</name>
				  <description>Overrun mode
	</description>
				  <bitOffset>12</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>ADC_DR register is preserved with the old data when an overrun is detected.</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>ADC_DR register is overwritten with the last conversion result when an overrun is detected.</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>CONT</name>
				  <description>Single / continuous conversion mode for regular conversions
	</description>
				  <bitOffset>13</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>Single conversion mode</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>Continuous conversion mode</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>AUTDLY</name>
				  <description>Delayed conversion mode
	</description>
				  <bitOffset>14</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>Auto-delayed conversion mode off</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>Auto-delayed conversion mode on</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>ALIGN</name>
				  <description>Data alignment
	</description>
				  <bitOffset>15</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>Right alignment</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>Left alignment</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>DISCEN</name>
				  <description>Discontinuous mode for regular channels
	</description>
				  <bitOffset>16</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>Discontinuous mode for regular channels disabled</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>Discontinuous mode for regular channels enabled</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>DISCNUM</name>
				  <description>Discontinuous mode channel count
	</description>
				  <bitOffset>17</bitOffset>
				  <bitWidth>3</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>1 channel</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>2 channels</description>
					  <value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x7</name>
					  <description>8 channels</description>
					  <value>0x7</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>JDISCEN</name>
				  <description>Discontinuous mode on injected channels
	</description>
				  <bitOffset>20</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>Discontinuous mode on injected channels disabled</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>Discontinuous mode on injected channels enabled</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>JQM</name>
				  <description>JSQR queue mode
	</description>
				  <bitOffset>21</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>JSQR mode 0: The Queue is never empty and maintains the last written configuration into JSQR.</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>JSQR mode 1: The Queue can be empty and when this occurs, the software and hardware triggers of the injected sequence are both internally disabled just after the completion of the last valid injected sequence.</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>AWD1SGL</name>
				  <description>Enable the watchdog 1 on a single channel or on all channels
	</description>
				  <bitOffset>22</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>Analog watchdog 1 enabled on all channels</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>Analog watchdog 1 enabled on a single channel</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>AWD1EN</name>
				  <description>Analog watchdog 1 enable on regular channels
	</description>
				  <bitOffset>23</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>Analog watchdog 1 disabled on regular channels</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>Analog watchdog 1 enabled on regular channels</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>JAWD1EN</name>
				  <description>Analog watchdog 1 enable on injected channels
	</description>
				  <bitOffset>24</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>Analog watchdog 1 disabled on injected channels</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>Analog watchdog 1 enabled on injected channels</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>JAUTO</name>
				  <description>Automatic injected group conversion
	</description>
				  <bitOffset>25</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>Automatic injected group conversion disabled</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>Automatic injected group conversion enabled</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>AWD1CH</name>
				  <description>Analog watchdog 1 channel selection
	</description>
				  <bitOffset>26</bitOffset>
				  <bitWidth>5</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>ADC analog input channel 0 monitored by AWD1 (available on ADC1 only)</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>ADC analog input channel 1 monitored by AWD1</description>
					  <value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x13</name>
					  <description>ADC analog input channel 19 monitored by AWD1</description>
					  <value>0x13</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
				<field>
				  <name>JQDIS</name>
				  <description>Injected queue disable
	</description>
				  <bitOffset>31</bitOffset>
				  <bitWidth>1</bitWidth>
				  <access>read-write</access>
				  <enumeratedValues>
					<enumeratedValue>
					  <name>B_0x0</name>
					  <description>Injected queue enabled</description>
					  <value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
					  <name>B_0x1</name>
					  <description>Injected queue disabled</description>
					  <value>0x1</value>
					</enumeratedValue>
				  </enumeratedValues>
				</field>
			  </fields>
			</register>
