knieriem/tinygo-stm32-svd/svd/stm32h562.svd
          <register>
            <name>FLASH_OPTSR_CUR</name>
            <displayName>FLASH_OPTSR_CUR</displayName>
            <description>FLASH option status register</description>
            <addressOffset>0x050</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>BOR_LEV</name>
                <description>Brownout level option status bit
These bits reflects the power level that generates a system reset.
00 or 11: BOR Level 1, the threshold level is low (around 2.1V)</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>BOR Level 2, the threshold level is medium (around 2.4V)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>BOR Level 3, the threshold level is high (around 2.7V)</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>BORH_EN</name>
                <description>Brownout high enable</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>disable</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>enable</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>IWDG_SW</name>
                <description>IWDG control mode option status bit</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>IWDG watchdog is controlled by hardware</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>IWDG watchdog is controlled by software</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WWDG_SW</name>
                <description>WWDG control mode option status bit</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>WWDG watchdog is controlled by hardware</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>WWDG watchdog is controlled by software</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>NRST_STOP</name>
                <description>Core domain Stop entry reset option status bit</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>a reset is generated when entering Stop mode on core domain</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>no reset generated when entering Stop mode on core domain.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>NRST_STDBY</name>
                <description>Core domain Standby entry reset option status bit</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>a reset is generated when entering Standby mode on core domain</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>no reset generated when entering Standby mode on core domain.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PRODUCT_STATE</name>
                <description>Life state code (based on Hamming 8,4). More information in Section7.6.11: Product state transitions.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>IO_VDD_HSLV</name>
                <description>High-speed IO at low V  DD  voltage configuration bit.
This bit can be set only with V  DD  below 2.7V.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>High-speed IO at low V  DD  voltage feature disabled (V  DD  can exceed 2.7V)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>High-speed IO at low V  DD  voltage feature enabled (V  DD  remains below 2.7V)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>IO_VDDIO2_HSLV</name>
                <description>High-speed IO at low V  DDIO2  voltage configuration bit.
This bit can be set only with V  DDIO2  below 2.7V.</description>
                <bitOffset>17</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>High-speed IO at low V  DDIO2  voltage feature disabled (V  DDIO2  can exceed 2.7V)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>High-speed IO at low V  DDIO2  voltage feature enabled (V  DDIO2  remains below 2.7V)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>IWDG_STOP</name>
                <description>IWDG Stop mode freeze option status bit
When set the independent watchdog IWDG is in system Stop mode.</description>
                <bitOffset>20</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Independent watchdog frozen in system Stop mode</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Independent watchdog keep running in system Stop mode.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>IWDG_STDBY</name>
                <description>IWDG Standby mode freeze option status bit
When set the independent watchdog IWDG is frozen in system Standby mode.</description>
                <bitOffset>21</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Independent watchdog frozen in Standby mode</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Independent watchdog keep running in Standby mode.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>BOOT_UBE</name>
                <description>Available only on cryptography enabled devices.
Unique boot entry control, selects either ST or OEM iRoT for secure boot.</description>
                <bitOffset>22</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0xC3</name>
                    <description>ST-iRoT (system flash) selected</description>
                    <value>0xC3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0xB4</name>
                    <description>OEM-iRoT (user flash) selected. In Open PRODUCT_STATE this value selects bootloader. Defaut value.</description>
                    <value>0xB4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SWAP_BANK</name>
                <description>Bank swapping option status bit
SWAP_BANK reflects whether Bank1 and Bank2 are swapped or not.  
SWAP_BANK is loaded to SWAP_BANK of FLASH_OPTCR after a reset.</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Bank1 and Bank2 not swapped</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Bank1 and Bank2 swapped</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH_OPTSR_PRG</name>
            <displayName>FLASH_OPTSR_PRG</displayName>
            <description>FLASH option status register</description>
            <addressOffset>0x054</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>BOR_LEV</name>
                <description>Brownout level option configuration bit
These bits reflects the power level that generates a system reset.
00 or 11: BOR Level 1, the threshold level is low (around 2.1 V)</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>BOR Level 2, the threshold level is medium (around 2.4 V)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>BOR Level 3, the threshold level is high (around 2.7 V)</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>BORH_EN</name>
                <description>Brownout high enable configuration bit</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>disable</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>enable</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>IWDG_SW</name>
                <description>IWDG control mode option configuration bit</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>IWDG watchdog is controlled by hardware</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>IWDG watchdog is controlled by software</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WWDG_SW</name>
                <description>WWDG control mode option configuration bit</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>WWDG watchdog is controlled by hardware</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>WWDG watchdog is controlled by software</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>NRST_STOP</name>
                <description>Core domain Stop entry reset option configuration bit</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>a reset is generated when entering Stop mode on core domain</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>no reset generated when entering Stop mode on core domain.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>NRST_STDBY</name>
                <description>Core domain Standby entry reset option configuration bit</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>a reset is generated when entering Standby mode on core domain</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>no reset generated when entering Standby mode on core domain.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PRODUCT_STATE</name>
                <description>Life state code (based on Hamming 8,4). More information in Section7.6.11: Product state transitions.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IO_VDD_HSLV</name>
                <description>High-speed IO at low VDD voltage configuration bit.
This bit can be set only with VDD below 2.7V.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>High-speed IO at low VDD voltage feature disabled (VDD can exceed 2.7V)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>High-speed IO at low VDD voltage feature enabled (VDD remains below 2.7V)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>IO_VDDIO2_HSLV</name>
                <description>High-speed IO at low VDDIO2 voltage configuration bit.
This bit can be set only with VDDIO2 below 2.7V.</description>
                <bitOffset>17</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>High-speed IO at low VDDIO2 voltage feature disabled (VDDIO2 can exceed 2.7V)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>High-speed IO at low VDDIO2 voltage feature enabled (VDDIO2 remains below 2.7V)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>IWDG_STOP</name>
                <description>IWDG Stop mode freeze option status bit
When set the independent watchdog IWDG is in system Stop mode.</description>
                <bitOffset>20</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Independent watchdog frozen in system Stop mode</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Independent watchdog keep running in system Stop mode.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>IWDG_STDBY</name>
                <description>IWDG Standby mode freeze option status bit
When set the independent watchdog IWDG is frozen in system Standby mode.</description>
                <bitOffset>21</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Independent watchdog frozen in Standby mode</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Independent watchdog keep running in Standby mode.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>BOOT_UBE</name>
                <description>Available only on cryptography enabled devices.
Unique boot entry control, selects either ST or OEM iRoT for secure boot. 
In Open PRODUCT_STATE this value selects bootloader. Defaut value.</description>
                <bitOffset>22</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0xC3</name>
                    <description>ST-iRoT (system flash) selected</description>
                    <value>0xC3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0xB4</name>
                    <description>OEM-iRoT (user flash) selected.</description>
                    <value>0xB4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SWAP_BANK</name>
                <description>Bank swapping option configuration bit
SWAP_BANK option bit is used to configure whether the Bank1 and Bank2 are swapped or not. This bit is loaded with the SWAP_BANK bit of FLASH_OPTSR_CUR register after a reset.</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Bank1 and Bank2 not swapped</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Bank1 and Bank2 swapped</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
