knieriem/tinygo-stm32-svd/svd/stm32h562.svd
          <register>
            <name>FLASH_NSEPOCHR_CUR</name>
            <displayName>FLASH_NSEPOCHR_CUR</displayName>
            <description>FLASH non-secure EPOCH register</description>
            <addressOffset>0x060</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>NS_EPOCH</name>
                <description>Non-volatile non-secure EPOCH counter</description>
                <bitOffset>0</bitOffset>
                <bitWidth>24</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH_SECEPOCHR_CUR</name>
            <displayName>FLASH_SECEPOCHR_CUR</displayName>
            <description>FLASH secure EPOCH register</description>
            <addressOffset>0x068</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>SEC_EPOCH</name>
                <description>Non-volatile secure EPOCH counter</description>
                <bitOffset>0</bitOffset>
                <bitWidth>24</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH_OPTSR2_CUR</name>
            <displayName>FLASH_OPTSR2_CUR</displayName>
            <description>FLASH option status register 2</description>
            <addressOffset>0x070</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>SRAM13_RST</name>
                <description>SRAM1 and SRAM3 erase upon system reset</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>SRAM1 and SRAM3 erased when a system reset occurs</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>SRAM1 and SRAM3 not erased when a system reset occurs</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SRAM2_RST</name>
                <description>SRAM2 erase when system reset</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>SRAM2 erased when a system reset occurs</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>SRAM2 not erased when a system reset occurs.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>BKPRAM_ECC</name>
                <description>Backup RAM ECC detection and correction disable</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>BKPRAM ECC check enabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>BKPRAM ECC check disabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SRAM3_ECC</name>
                <description>SRAM3 ECC detection and correction disable</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>SRAM3 ECC check enabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>SRAM3 ECC check disabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SRAM2_ECC</name>
                <description>SRAM2 ECC detection and correction disable</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>SRAM2 ECC check enabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>SRAM2 ECC check disabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>USBPD_DIS</name>
                <description>USB power delivery configuration option bit</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Enabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Disabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TZEN</name>
                <description>TrustZone enable configuration bits
This bit enables the device is in TrustZone mode during an option byte change.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0xC3</name>
                    <description>TrustZone disabled</description>
                    <value>0xC3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0xB4</name>
                    <description>TrustZone enabled.</description>
                    <value>0xB4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH_OPTSR2_PRG</name>
            <displayName>FLASH_OPTSR2_PRG</displayName>
            <description>FLASH option status register 2</description>
            <addressOffset>0x074</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>SRAM1_3_RST</name>
                <description>SRAM1 and SRAM3 erase upon system reset
Note: SRAM erase is triggered by option byte change operation, when enabling this feature.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>SRAM1 and SRAM3 erased when a system reset occurs</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>SRAM1 and SRAM3 not erased when a system reset occurs</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SRAM2_RST</name>
                <description>SRAM2 erase when system reset
Note: SRAM erase is triggered by option byte change operation, when enabling this feature.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>SRAM2 erased when a system reset occurs</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>SRAM2 not erased when a system reset occurs.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>BKPRAM_ECC</name>
                <description>Backup RAM ECC detection and correction disable</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>BKPRAM ECC check enabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>BKPRAM ECC check disabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SRAM3_ECC</name>
                <description>SRAM3 ECC detection and correction disable</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>SRAM3 ECC check enabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>SRAM3 ECC check disabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SRAM2_ECC</name>
                <description>SRAM2 ECC detection and correction disable</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>SRAM2 ECC check enabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>SRAM2 ECC check disabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>USBPD_DIS</name>
                <description>USB power delivery configuration option bit</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Enabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Disabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TZEN</name>
                <description>TrustZone enable configuration bits
This bit enables the device is in TrustZone mode during an option byte change.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0xC3</name>
                    <description>TrustZone disabled</description>
                    <value>0xC3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0xB4</name>
                    <description>TrustZone enabled</description>
                    <value>0xB4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH_NSBOOTR_CUR</name>
            <displayName>FLASH_NSBOOTR_CUR</displayName>
            <description>FLASH non-secure boot register</description>
            <addressOffset>0x080</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>NSBOOT_LOCK</name>
                <description>A field locking the values of SWAP_BANK, and NSBOOTADD settings.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0xC3</name>
                    <description>The SWAP_BANK and NSBOOTADD can still be modified following their individual rules.</description>
                    <value>0xC3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0xB4</name>
                    <description>The NSBOOTADD is frozen. SWAP_ BANK can only be modified with TZEN set to 0xB4 (enabled).</description>
                    <value>0xB4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>NSBOOTADD</name>
                <description>Non secure unique boot entry address
These bits reflect the Non secure UBE address</description>
                <bitOffset>8</bitOffset>
                <bitWidth>24</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH_NSBOOTR_PRG</name>
            <displayName>FLASH_NSBOOTR_PRG</displayName>
            <description>FLASH non-secure boot register</description>
            <addressOffset>0x084</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>NSBOOT_LOCK</name>
                <description>A field locking the values of SWAP_ BANK, and NSBOOTADD settings.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0xC3</name>
                    <description>The SWAP_ BANK and NSBOOTADD can still be modified following their individual rules.</description>
                    <value>0xC3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0xB4</name>
                    <description>The NSBOOTADD is frozen. SWAP_ BANK can only be modified with TZEN set to 0xB4 (enabled).</description>
                    <value>0xB4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>NSBOOTADD</name>
                <description>Non secure unique boot entry address 
These bits allow configuring the Non secure BOOT address</description>
                <bitOffset>8</bitOffset>
                <bitWidth>24</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH_SECBOOTR_CUR</name>
            <displayName>FLASH_SECBOOTR_CUR</displayName>
            <description>FLASH secure boot register</description>
            <addressOffset>0x088</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>SECBOOT_LOCK</name>
                <description>A field locking the values of UBE, SWAP_BANK, and SECBOOTADD settings.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0xC3</name>
                    <description>The BOOT_UBE, SWAP_BANK and SECBOOTADD can still be modified following their individual rules.</description>
                    <value>0xC3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0xB4</name>
                    <description>The BOOT_UBE and SECBOOTADD are frozen. SWAP_ BANK can only be modified with TZEN set to 0xC3 (disabled).</description>
                    <value>0xB4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SECBOOTADD</name>
                <description>Unique boot entry secure address 
These bits reflect the Secure UBE address</description>
                <bitOffset>8</bitOffset>
                <bitWidth>24</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH_BOOTR_PRG</name>
            <displayName>FLASH_BOOTR_PRG</displayName>
            <description>FLASH secure boot register</description>
            <addressOffset>0x08C</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>SECBOOT_LOCK</name>
                <description>A field locking the values of UBE, SWAP_ BANK, and SECBOOTADD setting.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0xC3</name>
                    <description>The BOOT_UBE, SWAP_ BANK and SECBOOTADD can still be modified following their individual rules.</description>
                    <value>0xC3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0xB4</name>
                    <description>The BOOT_UBE and SECBOOTADD are frozen. SWAP_BANK can only be modified with TZEN set to 0xC3 (disabled).</description>
                    <value>0xB4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SECBOOTADD</name>
                <description>Secure unique boot entry address.
These bits allow configuring the secure UBE address.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>24</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH_OTPBLR_CUR</name>
            <displayName>FLASH_OTPBLR_CUR</displayName>
            <description>FLASH non-secure OTP block lock</description>
            <addressOffset>0x090</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>LOCKBL</name>
                <description>OTP block lock 
Block n corresponds to OTP 16-bit word 32 x n to 32 x n + 31.
LOCKBL[n] = 1 indicates that all OTP 16-bit words in OTP Block n are locked and attempt to program them results in WRPERR.
LOCKBL[n] = 0 indicates that all OTP 16-bit words in OTP Block n are not locked.
When one block is locked, it's not possible to remove the write protection.
Also if not locked, it is not possible to erase OTP words.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH_OTPBLR_PRG</name>
            <displayName>FLASH_OTPBLR_PRG</displayName>
            <description>FLASH non-secure OTP block lock</description>
            <addressOffset>0x094</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>LOCKBL</name>
                <description>OTP block lock 
Block n corresponds to OTP 16-bit word 32 x n to 32 x n + 31.
LOCKBL[n] = 1 indicates that all OTP 16-bit words in OTP Block n are locked and attempt to program them results in WRPERR.
LOCKBL[n] = 0 indicates that all OTP 16-bit words in OTP Block n are not locked.
When one block is locked, it is not possible to remove the write protection.
LOCKBL bits can be set if the corresponding bit in FLASH_OTPBLR_CUR is cleared.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
