knieriem/tinygo-stm32-svd/svd/stm32h562.svd
          <register>
            <name>HASH_CSR24</name>
            <displayName>HASH_CSR24</displayName>
            <description>HASH context swap register 24</description>
            <addressOffset>0x158</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap 24
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR25</name>
            <displayName>HASH_CSR25</displayName>
            <description>HASH context swap register 25</description>
            <addressOffset>0x15c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap 25
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR26</name>
            <displayName>HASH_CSR26</displayName>
            <description>HASH context swap register 26</description>
            <addressOffset>0x160</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap 26
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR27</name>
            <displayName>HASH_CSR27</displayName>
            <description>HASH context swap register 27</description>
            <addressOffset>0x164</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap 27
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR28</name>
            <displayName>HASH_CSR28</displayName>
            <description>HASH context swap register 28</description>
            <addressOffset>0x168</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap 28
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR29</name>
            <displayName>HASH_CSR29</displayName>
            <description>HASH context swap register 29</description>
            <addressOffset>0x16c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap 29
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR30</name>
            <displayName>HASH_CSR30</displayName>
            <description>HASH context swap register 30</description>
            <addressOffset>0x170</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap 30
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR31</name>
            <displayName>HASH_CSR31</displayName>
            <description>HASH context swap register 31</description>
            <addressOffset>0x174</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap 31
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR32</name>
            <displayName>HASH_CSR32</displayName>
            <description>HASH context swap register 32</description>
            <addressOffset>0x178</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap 32
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR33</name>
            <displayName>HASH_CSR33</displayName>
            <description>HASH context swap register 33</description>
            <addressOffset>0x17c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap 33
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR34</name>
            <displayName>HASH_CSR34</displayName>
            <description>HASH context swap register 34</description>
            <addressOffset>0x180</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap 34
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR35</name>
            <displayName>HASH_CSR35</displayName>
            <description>HASH context swap register 35</description>
            <addressOffset>0x184</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap 35
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR36</name>
            <displayName>HASH_CSR36</displayName>
            <description>HASH context swap register 36</description>
            <addressOffset>0x188</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap 36
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR37</name>
            <displayName>HASH_CSR37</displayName>
            <description>HASH context swap register 37</description>
            <addressOffset>0x18c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap 37
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR38</name>
            <displayName>HASH_CSR38</displayName>
            <description>HASH context swap register 38</description>
            <addressOffset>0x190</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap 38
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR39</name>
            <displayName>HASH_CSR39</displayName>
            <description>HASH context swap register 39</description>
            <addressOffset>0x194</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap 39
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR40</name>
            <displayName>HASH_CSR40</displayName>
            <description>HASH context swap register 40</description>
            <addressOffset>0x198</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap 40
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR41</name>
            <displayName>HASH_CSR41</displayName>
            <description>HASH context swap register 41</description>
            <addressOffset>0x19c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap 41
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR42</name>
            <displayName>HASH_CSR42</displayName>
            <description>HASH context swap register 42</description>
            <addressOffset>0x1a0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap 42
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR43</name>
            <displayName>HASH_CSR43</displayName>
            <description>HASH context swap register 43</description>
            <addressOffset>0x1a4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap 43
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR44</name>
            <displayName>HASH_CSR44</displayName>
            <description>HASH context swap register 44</description>
            <addressOffset>0x1a8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap 44
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR45</name>
            <displayName>HASH_CSR45</displayName>
            <description>HASH context swap register 45</description>
            <addressOffset>0x1ac</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap 45
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR46</name>
            <displayName>HASH_CSR46</displayName>
            <description>HASH context swap register 46</description>
            <addressOffset>0x1b0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap 46
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR47</name>
            <displayName>HASH_CSR47</displayName>
            <description>HASH context swap register 47</description>
            <addressOffset>0x1b4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap 47
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR48</name>
            <displayName>HASH_CSR48</displayName>
            <description>HASH context swap register 48</description>
            <addressOffset>0x1b8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap 48
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR49</name>
            <displayName>HASH_CSR49</displayName>
            <description>HASH context swap register 49</description>
            <addressOffset>0x1bc</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap 49
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR50</name>
            <displayName>HASH_CSR50</displayName>
            <description>HASH context swap register 50</description>
            <addressOffset>0x1c0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap 50
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR51</name>
            <displayName>HASH_CSR51</displayName>
            <description>HASH context swap register 51</description>
            <addressOffset>0x1c4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap 51
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR52</name>
            <displayName>HASH_CSR52</displayName>
            <description>HASH context swap register 52</description>
            <addressOffset>0x1c8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap 52
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR53</name>
            <displayName>HASH_CSR53</displayName>
            <description>HASH context swap register 53</description>
            <addressOffset>0x1cc</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap 53
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR54</name>
            <displayName>HASH_CSR54</displayName>
            <description>HASH context swap register 54</description>
            <addressOffset>0x1d0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap 54
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR55</name>
            <displayName>HASH_CSR55</displayName>
            <description>HASH context swap register 55</description>
            <addressOffset>0x1d4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap 55
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR56</name>
            <displayName>HASH_CSR56</displayName>
            <description>HASH context swap register 56</description>
            <addressOffset>0x1d8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap 56
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR57</name>
            <displayName>HASH_CSR57</displayName>
            <description>HASH context swap register 57</description>
            <addressOffset>0x1dc</addressOffset>
            <size>0x20</size>
            <resetValue>0x00220002</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CSx</name>
                <description>Context swap 57
Refer to  introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
