knieriem/tinygo-stm32-svd/svd/stm32h562.svd
      </registers>
    </peripheral>
	<peripheral derivedFrom="I2C1">
      <name>SEC_I2C1</name>
      <baseAddress>0x50005400</baseAddress>
    </peripheral>
	<peripheral derivedFrom="I2C1">
      <name>I2C2</name>
      <baseAddress>0x40005800</baseAddress>
	  <interrupt>
        <name>I2C2_EV</name>
        <description>I2C2 event interrupt</description>
        <value>53</value>
      </interrupt>
      <interrupt>
        <name>I2C2_ER</name>
        <description>I2C2 error interrupt</description>
        <value>54</value>
      </interrupt>
    </peripheral>
	<peripheral derivedFrom="I2C1">
      <name>SEC_I2C2</name>
      <baseAddress>0x50005800</baseAddress>
    </peripheral>
	<peripheral derivedFrom="I2C1">
      <name>I2C3</name>
      <baseAddress>0x44002800</baseAddress>
	  <interrupt>
        <name>I2C3_EV</name>
        <description>I2C3 event interrupt</description>
        <value>80</value>
      </interrupt>
      <interrupt>
        <name>I2C3_ER</name>
        <description>I2C3 error interrupt</description>
        <value>81</value>
      </interrupt>
    </peripheral>
	<peripheral derivedFrom="I2C1">
      <name>SEC_I2C3</name>
      <baseAddress>0x54002800</baseAddress>
    </peripheral>
	<peripheral derivedFrom="I2C1">
      <name>I2C4</name>
      <baseAddress>0x44002C00</baseAddress>
	  <interrupt>
        <name>I2C4_EV</name>
        <description>I2C4 event interrupt</description>
        <value>125</value>
      </interrupt>
      <interrupt>
        <name>I2C4_ER</name>
        <description>I2C4 error interrupt</description>
        <value>126</value>
      </interrupt>
    </peripheral>
	<peripheral derivedFrom="I2C1">
      <name>SEC_I2C4</name>
      <baseAddress>0x54002C00</baseAddress>
    </peripheral>
	<peripheral>
        <name>I3C</name>
        <description>Improved inter-integrated circuit</description>
		<groupName>I3C</groupName>
        <baseAddress>0x40005C00</baseAddress>
		<addressBlock>
          <offset>0x0</offset>
          <size>0x400</size>
          <usage>registers</usage>
        </addressBlock>
		<interrupt>
          <name>I3C1_EV</name>
          <description>I3C1 event interrupt </description>
          <value>123</value>
        </interrupt>
		<interrupt>
          <name>I3C1_ER</name>
          <description>I3C1 error interrupt </description>
          <value>124</value>
        </interrupt>
        <registers>
          <register>
            <name>I3C_CR</name>
            <displayName>I3C_CR</displayName>
            <description>I3C message control register </description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>DCNT</name>
                <description>count of data to transfer during a read or write message, in bytes (whatever I3C is acting as controller/target)
Linear encoding up to 64 Kbytes -1
...</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>no data to transfer</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>1 byte</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>2 bytes</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0xFFFF</name>
                    <description>64 Kbytes 1 byte</description>
                    <value>0xFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RNW</name>
                <description>read / non-write message (when I3C is acting as controller)
When I3C is acting as controller, this field is used if MTYPE[3:0]=0010 (private message) or MTYPE[3:0]=0011 (direct message) or MTYPE[3:0]=0100 (legacy I2C message), in order to emit the RnW bit on the I3C bus.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>write message</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>read message</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ADD</name>
                <description>7-bit I3C dynamic / I2C static target address (when I3C is acting as controller)
When I3C is acting as controller, this field is used if MTYPE[3:0]=0010 (private message) or MTYPE[3:0]=0011 (direct message) or MTYPE[3:0]=0100 (legacy I2C message)</description>
                <bitOffset>17</bitOffset>
                <bitWidth>7</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>MTYPE</name>
                <description>message type (whatever I3C is acting as controller/target)
Bits[26:0] are ignored.
After M2 error detection on an I3C SDR message, this is needed for SCL 'stuck at' recovery.
Bits[26:0] are ignored.
If I3C_CFGR.EXITPTRN=1, an HDR exit pattern is emitted on the bus to generate an escalation fault.
Bits[23:17] (ADD[6:0]) is the emitted 7-bit dynamic address.
Bit[16] (RNW) is the emitted RnW bit.
The transferred private message is:
{S / S+7'h7E+RnW=0+Sr / Sr+*} + 7-bit DynAddr + RnW + (8-bit Data + T)* + Sr/P.
After a S (START), depending on I3C_CFGR.NOARBH, the arbitrable header (7'h7E+RnW=0) is inserted or not.
Sr+*: after a Sr (Repeated Start), the hardware automatically inserts (7'h7E+RnW=0) if needed, i.e. if it follows an I3C direct message without ending by a P (Stop).
Bits[23:17] (ADD[6:0]) is the emitted 7-bit dynamic address.
Bit[16] (RNW) is the emitted RnW bit.
The transferred direct message is:
Sr + 7-bit DynAddr + RnW + (8-bit Data + T)* + Sr/P
Bits[23:17] (ADD[6:0]) is the emitted 7-bit static address.
Bit[16] (RNW) is the emitted RnW bit.
The transferred legacy I2C message is:
{S / S+ 7'h7E+RnW=0 + Sr / Sr+*} + 7-bit StaAddr + RnW + (8-bit Data + T)* + Sr/P.
After a S (START), depending on I3C_CFGR.NOARBH, the arbitrable header (7'h7E+RnW=0) is inserted or not.
Sr+*: after a Sr (Repeated Start), the hardware automatically inserts (7'h7E+RnW=0) if needed, i.e. if it follows an I3C direct message without ending by a P (Stop).
1xxx: reserved (when I3C is acting as I3C controller, used when target)
0xxx: reserved
{S +} 7'h02 addr + RnW=0
{S +} 7-bit I3C_DEVR0.DA[6:0] + RnW=0
after a bus available condition (the target first emits a START request), or once the controller drives a START.
{S +} 7-bit I3C_DEVR0.DA[6:0] + RnW=1 (+Ack/Nack from controller)
When acknowledged from controller, the next (optional, depending on I3C_BCR.BCR2) transmitted IBI payload data is defined by I3C_CR.DCNT[15:0] and must be consistently programmed vs the maximum IBI payload data size which is defined by I3C_IBIDR.IBIP[2:0].
Others: reserved</description>
                <bitOffset>27</bitOffset>
                <bitWidth>4</bitWidth>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0_WHEN_I3C_IS_ACTING_AS_I3C_CONTROLLER</name>
                    <description>SCL output clock stops running until next control word is executed </description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1_WHEN_I3C_IS_ACTING_AS_I3C_CONTROLLER</name>
                    <description>header message</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2_WHEN_I3C_IS_ACTING_AS_I3C_CONTROLLER</name>
                    <description>private message</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3_WHEN_I3C_IS_ACTING_AS_I3C_CONTROLLER</name>
                    <description>direct message (2nd part of an I3C SDR direct CCC command)</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x4_WHEN_I3C_IS_ACTING_AS_I3C_CONTROLLER</name>
                    <description>legacy I2C message</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x6_WHEN_I3C_IS_ACTING_AS_I3C_CONTROLLER</name>
                    <description>reserved (for this 1st alternate register description)</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x8_WHEN_I3C_IS_ACTING_AS_I3C_TARGET</name>
                    <description>hot-join request (W)</description>
                    <value>0x8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x9_WHEN_I3C_IS_ACTING_AS_I3C_TARGET</name>
                    <description>controller-role request (W)</description>
                    <value>0x9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0xA_WHEN_I3C_IS_ACTING_AS_I3C_TARGET</name>
                    <description>IBI (in-band interrupt) request (R)</description>
                    <value>0xA</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MEND</name>
                <description>message end type (when the I3C is acting as controller)</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>this message from controller ends with a Repeated START (Sr)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>this message from controller ends with a STOP (P), being the last message of a frame</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
		  <register>
            <name>I3C_CR_ALTERNATE</name>
            <displayName>I3C_CR_ALTERNATE</displayName>
            <description>I3C message control register alternate</description>
		    <alternateRegister>I3C_CR</alternateRegister>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
			  <field>
                <name>DCNT</name>
                <description>count of data to transfer during a read or write message, in bytes (when I3C is acting as controller)
Linear encoding up to 64 Kbytes -1.
...</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>no data to transfer (allowed for write message and only for GET CCC read commands. Mandated value when emitting ENTDAA)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>1 byte</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>2 bytes</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0xFFFF</name>
                    <description>64 Kbytes 1 byte</description>
                    <value>0xFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CCC</name>
                <description>8-bit CCC code (when I3C is acting as controller)
If Bit[23]=CCC[7]=1, this is the 1st part of an I3C SDR direct CCC command.
If Bit[23]=CCC[7]=0, this is an I3C SDR broadcast CCC command (including ENTDAA and ENTHDR0).</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>MTYPE</name>
                <description>message type (when I3C is acting as controller)
Bits[23:16] (CCC[7:0]) is the emitted 8-bit CCC code
If Bit[23]=CCC[7]=1: this is the 1st part of an I3C SDR direct CCC command
The transferred direct CCC command message is:
{S / S+7'h7E +RnW=0 / Sr+*} + (direct CCC + T) + (8-bit Data + T)* + Sr
After a S (START), depending on I3C_CFGR.NOARBH, the arbitrable header (7'h7E+RnW=0) is inserted or not.
Sr+*: after a Sr (Repeated Start), the hardware automatically inserts (7'h7E+R/W).
If Bit[23]=CCC[7]=0: this is an I3C SDR broadcast CCC command (including ENTDAA and ENTHDR0)
The transferred broadcast CCC command message is:
{S / S+7'h7E +RnW=0 / Sr+*} + (broadcast CCC + T) + (8-bit Data + T)* + Sr/P
After a S (START), depending on I3C_CFGR.NOARBH, the arbitrable header (7'h7E+RnW=0) is inserted or not.
Sr+*: after a Sr (Repeated Start), the hardware automatically inserts (7'h7E+R/W).
others: reserved</description>
                <bitOffset>27</bitOffset>
                <bitWidth>4</bitWidth>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x6_WHEN_I3C_IS_ACTING_AS_I3C_CONTROLLER</name>
                    <description>CCC command</description>
                    <value>0x6</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MEND</name>
                <description>message end type (when I3C is acting as controller)</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>this message from the controller ends with a Repeated START (Sr)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>the message from the controller ends with a STOP (P), being the last message of a frame</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
			</fields>
          </register>
